const menuData = [
  {
    title: "موبایل",
    icon: "mobile_2",
    subcategories: [
      { title: "انتخاب موبایل" },
      {
        title: "آیفون",
        children: [
          "آیفون ۱۶",
          "آیفون ۱۶ ای",
          "آیفون ۱۶ پرو",
          "آیفون ۱۶ پرومکس",
          "آیفون ۱۵",
          "آیفون ۱۴",
          "آیفون ۱۳",
        ],
      },
      {
        title: "برندهای مختلف گوشی موبایل",
        children: [
          "سامسونگ",
          "شیائومی",
          "نوکیا",
          "ریلمی",
          "آنر",
          "وکال",
          "ردتون",
          "تی سی ال",
          "هواوی",
          "داریا",
        ],
      },
      {
        title: "برندهای برتر",
        children: ["سامسونگ", "اپل", "ردتون", "آنر", "ریلمی", "اچ ام دی"],
      },
      {
        title: "گوشی براساس قیمت",
        children: [
          "گوشی ارزان",
          "گوشی قسطی",
          "گوشی تا ۵ میلیون",
          "گوشی تا ۱۰ میلیون",
          "گوشی تا ۲۰ میلیون",
        ],
      },
      {
        title: "گوشی براساس عملکرد",
        children: [
          "گوشی گیمینگ",
          "گوشی 5G",
          "گوشی ضدآب",
          "گوشی دکمه ای",
          "گوشی میان رده",
          "گوشی دانش آموزی",
          "گوشی دو سیمکارت",
        ],
      },
      {
        title: "گوشی براساس حافظه داخلی",
        children: [
          "گوشی 64 گیگابایت",
          "گوشی 128 گیگابایت",
          "گوشی 256 گیگابایت",
          "گوشی 512 گیگابایت",
          "گوشی یک ترابایت",
        ],
      },
      {
        title: "رزولوشن عکس",
        children: [
          "گوشی با دوربین 48 مگاپیکسل",
          "گوشی با دوربین 50 مگاپیکسل",
          "گوشی با دوربین 64 مگاپیکسل",
          "گوشی با دوربین 108 مگاپیکسل",
        ],
      },
      {
        title: "لوازم جانبی موبایل",
        children: [
          "شارژر گوشی",
          "شارژر وایرلس",
          "شارژر تایپ سی",
          "شارژر فندکی",
          "هولدر موبایل",
          "کابل شارژر",
          "پاوربانک",
          "مونوپاد",
          "کاور ایرپاد",
          "دسته بازی موبایل",
        ],
      },
      {
        title: "قاب گوشی",
        children: [
          "قاب گوشی سامسونگ",
          "قاب گوشی آیفون",
          "قاب گوشی ریلمی",
          "قاب گوشی پوکو",
          "قاب گوشیوکال",
        ],
      },
      {
        title: "هدفون",
        children: [
          "هدفون بی سیم",
          "هدفون گیمینگ",
          "هدفون اپل",
          "هدفون بیتس",
          "هدفون سونی",
          "هدفون انکر",
        ],
      },
      {
        title: "ساعت و مچ بند هوشمند",
        children: ["ساعت هوشمند اپل", "ساعت هوشمند سامسونگ"],
      },
    ],
  },
  {
    title: "لوازم‌تحریر",
    icon: "ink_pen",
    subcategories: [
      {
        title: "نوشت افزار",
        children: [
          "مداد",
          "مداد تراش",
          "مداد طراحی",
          "ماژیک",
          "خودکار و روان نویس",
          "اتود",
          "پاک کن",
          "غلط گیر",
        ],
      },
      {
        title: "ابزار طراحی و مهندسی",
        children: ["خط کش پلاستیکی", "خط کش فلزی", "پرگار"],
      },
      {
        title: "دفتر و کاغذ و مقوا",
        children: ["دفتر کلاسوری", "دفتر طراحی", "دفتر نقاشی", "کاغذ", "مقوا"],
      },
      {
        title: "کیف و کوله مدرسه",
        children: [
          "کوله پشتی ضدآب",
          "کوله پشتی چرخدار",
          "کوله پشتی هری پاتر",
          "کوله پشتی بتمن",
          "کوله پشتی باب اسفنجی",
        ],
      },
      {
        title: "جامدادی",
        children: [
          "جامدادی تبلتی",
          "جامدادی کرومی",
          "جامدادی بتمن",
          "جامدادی مرد عنکبوتی",
          "جامدادی انیمه",
        ],
      },
      {
        title: "ابزار نقاشی و رنگ آمیزی",
        children: [
          "پاستل و مداد شعمی",
          "آبرنگ و گواش",
          "قلم مو",
          "پالت رنگ",
          "بوم نقاشی",
        ],
      },
      { title: "میز تحریر", children: ["میز تحریر کودک", "میز تحریر کرومی"] },
      {
        title: "برندهای لوازم تحریر",
        children: ["آریا", "کیان", "پاپکو", "استدلر", "پنتر"],
      },
    ],
  },
  {
    title: "لپ تاپ",
    icon: "laptop_chromebook",
    subcategories: [
      {
        title: "لپ تاپ ایسوس",
        children: [
          "لپ تاپ Vivobook",
          "لپ تاپ Zenbook",
          "لپ تاپ  TUF Gamming",
          "لپ تاپ ROG",
        ],
      },
      {
        title: "لپ تاپ لنوو",
        children: [
          "لپ تاپ v15",
          "لپ تاپ ideapad 1",
          "لپ تاپ ideapad slim 3",
          "لپ تاپ LOQ",
        ],
      },
      {
        title: "مک بوک",
        children: [
          "مک بوک ایر m1",
          "مک بوک ایر m2",
          "مک بوک ایر m3",
          "مک بوک ایر m4",
          "مک بوک پرو m4",
        ],
      },
      {
        title: "لپ تاپ سرفیس",
        children: [
          "سرفیس لپ تاپ ۵",
          "سرفیس لپ تاپ ۶",
          "سرفیس لپ تاپ ۷",
          "سرفیس لپ تاپ استودیو ۲",
        ],
      },
      {
        title: "لپ تاپ گیمینگ",
        children: [
          "لپ تاپ گیمینگ ایسوس",
          "لپ تاپ گیمینگ لنوو",
          "لپ تاپ گیمینگ HP",
          "لپ تاپ گیمینگ acer",
          "لپ تاپ گیمینگ msi",
        ],
      },
      {
        title: "لپ تاپ ایسوس",
        children: [
          "لپ تاپ Vivobook",
          "لپ تاپ Zenbook",
          "لپ تاپ  TUF Gamming",
          "لپ تاپ ROG",
        ],
      },
      {
        title: "لپ تاپ لنوو",
        children: [
          "لپ تاپ v15",
          "لپ تاپ ideapad 1",
          "لپ تاپ ideapad slim 3",
          "لپ تاپ LOQ",
        ],
      },
      {
        title: "مک بوک",
        children: [
          "مک بوک ایر m1",
          "مک بوک ایر m2",
          "مک بوک ایر m3",
          "مک بوک ایر m4",
          "مک بوک پرو m4",
        ],
      },
      {
        title: "بر اساس مدل کارت گرافیک",
        children: [
          "لپ تاپ rtx 2050",
          "لپ تاپ rtx 3050",
          "لپ تاپ rtx 3060",
          "لپ تاپ rtx 4050",
          "لپ تاپ rtx 4070",
        ],
      },
      {
        title: "بر اساس قیمت",
        children: [
          "لپ تاپ تا ۱۵ میلیون",
          "لپ تاپ تا ۲۰ میلیون",
          "لپ تاپ تا ۳۰ میلیون",
          "لپ تاپ تا ۴۰ میلیون",
          "لپ تاپ تا ۵۰ میلیون",
        ],
      },
      {
        title: "لوازم جانبی لپ تاپ",
        children: ["کول پد", "کیف لپ تاپ", "شارژر", "ماوس", "ماوس پد"],
      },
    ],
  },
  {
    title: "کالای دیجیتال",
    icon: "devices",
    subcategories: [
      {
        title: "کنسول بازی",
        children: ["ps5", "ps5 slim", "ps5 pro", "ps4", "xbox"],
      },
      {
        title: "وسایل گیمینگ",
        children: [
          "ست گیمینگ",
          "دسته بازی",
          "دیسک های بازی",
          "فرمان بازی",
          "صندلی گیمینگ",
        ],
      },
      {
        title: "تبلت",
        children: ["تبلت سامسونگ", "تبلت ایسوس", "تبلت نارتب", "تبلت  لنوو"],
      },
      {
        title: "کامپیوتر",
        children: [
          "all in one",
          "mini pc",
          "قلم نوری",
          "رم ریدر",
          "کیس اسمبل شده",
        ],
      },
      {
        title: "اسپیکر",
        children: [
          "اسپیکر بلوتوثی",
          "اسپیکر هارمن کاردن",
          "اسپیکر سونی",
          "اسپیکر تسکو",
          "اسپیکر مکسیدر",
        ],
      },
      {
        title: "کنسول بازی",
        children: ["ps5", "ps5 slim", "ps5 pro", "ps4", "xbox"],
      },
      {
        title: "وسایل گیمینگ",
        children: [
          "ست گیمینگ",
          "دسته بازی",
          "دیسک های بازی",
          "فرمان بازی",
          "صندلی گیمینگ",
        ],
      },
      {
        title: "تبلت",
        children: ["تبلت سامسونگ", "تبلت ایسوس", "تبلت نارتب", "تبلت  لنوو"],
      },
      { title: "باتری", children: ["باتری لیتیومی", "باتری قلمی"] },
      {
        title: "پرینتر",
        children: [
          "پرینتر سه بعدی",
          "پرینتر حرارتی",
          "پرینتر رنگی",
          "پرینتر لیبل زن",
          "پرینتر اچ پی",
        ],
      },
      {
        title: "کیبورد",
        children: ["کیبورد گیمینگ", "کیبورد بی سیم", "کیبورد مکانیکال"],
      },
    ],
  },
  {
    title: "خانه و آشپزخانه",
    icon: "chair",
    subcategories: [
      {
        title: "ظروف پخت و پز",
        children: ["قابلمه و تابه", "زودپز", "سرویس پخت و پز"],
      },
      {
        title: "ابزار آشپزی",
        children: ["ست کفگیر و ملاقه", "چاقو", "تخته گوشت", "قیف", "صافی"],
      },
      {
        title: "مبل",
        children: ["مبل راحتی", "مبل بادی", "مبل تدی", "مبل ال", "مبل چستر"],
      },
      {
        title: "دکوراسیون خانگی",
        children: ["کتابخانه", "شلف و طبقه", "کنسول", "صندلی", "میز"],
      },
      { title: "قاب و تابلو", children: ["قاب", "تابلو"] },
      {
        title: "ظروف پخت و پز",
        children: ["قابلمه و تابه", "زودپز", "سرویس پخت و پز"],
      },
      {
        title: "ابزار آشپزی",
        children: ["ست کفگیر و ملاقه", "چاقو", "تخته گوشت", "قیف", "صافی"],
      },
      {
        title: "مبل",
        children: ["مبل راحتی", "مبل بادی", "مبل تدی", "مبل ال", "مبل چستر"],
      },
      {
        title: "شستشو و نظافت",
        children: ["سطل", "تی", "فرچه", "جارو و خاک انداز"],
      },
      {
        title: "نظافت لباس",
        children: [
          "پرزگیر لباس",
          "گیره لباس",
          "کاور پوشاک",
          "کیسه وکیوم",
          "بند رخت",
        ],
      },
      {
        title: "فرش و گلیم",
        children: ["فرش", "موکت", "تابلو فرش", "پادری", "روفرشی"],
      },
    ],
  },
  {
    title: "لوازم خانگی برقی",
    icon: "kitchen",
    subcategories: [
      {
        title: "جارو برقی",
        children: ["جارو برقی", "جارو شارژی", "جارو رباتیک"],
      },
      {
        title: "ماشین لباسشویی",
        children: [
          "ماشین لباسشویی دوو",
          "ماشین لباسشویی پاکشوما",
          "ماشین لباسشویی اسنوا",
        ],
      },
      {
        title: "صوتی و تصویری",
        children: [
          "ساندبار",
          "ویدیوپروژکتور",
          "اندروید باکس",
          "پخش کننده خانگی",
          "ریموت کنترل",
        ],
      },
      {
        title: "یخچال و فریزر",
        children: [
          "یخچال و فریزر ساید بای ساید",
          "یخچال و فریزر دوقلو",
          "یخچال و فریزر هتلی",
        ],
      },
      {
        title: "تلوزیون",
        children: [
          "تلوزیون گیمینگ",
          "تلوزیون 4k",
          "تلوزیون OLED",
          "تلوزیون QLED",
          "میزتلوزیون",
        ],
      },
      { title: "اتو", children: ["اتو بخار", "اتو بخار ایستاده", "بخارگر"] },
      {
        title: "جارو برقی",
        children: ["جارو برقی", "جارو شارژی", "جارو رباتیک"],
      },
      {
        title: "ماشین لباسشویی",
        children: [
          "ماشین لباسشویی دوو",
          "ماشین لباسشویی پاکشوما",
          "ماشین لباسشویی اسنوا",
        ],
      },
      {
        title: "صوتی و تصویری",
        children: [
          "ساندبار",
          "ویدیوپروژکتور",
          "اندروید باکس",
          "پخش کننده خانگی",
          "ریموت کنترل",
        ],
      },
      {
        title: "یخچال و فریزر",
        children: [
          "یخچال و فریزر ساید بای ساید",
          "یخچال و فریزر دوقلو",
          "یخچال و فریزر هتلی",
        ],
      },
      {
        title: "خردکن و غذاساز",
        children: ["گوشت کوب برقی", "غذا ساز", "همزن", "مخلوط کن", "آسیاب"],
      },
      { title: "لوازم تو کار", children: ["فر", "هود", "گاز صفحه ای"] },
    ],
  },
  {
    title: "آرایشی بهداشتی",
    icon: "heart_check",
    subcategories: [
      {
        title: "لوازم آرایشی",
        children: [
          "آرایش صورت",
          "آرایش چشم",
          "آرایش ابرو",
          "آرایش لب",
          "ابزار آرایشی",
        ],
      },
      {
        title: "مراقبت پوست",
        children: [
          "ضد آفتاب",
          "کرم مرطوب کننده",
          "ماسک صورت",
          "پاک کننده صورت",
          "تونر",
        ],
      },
      {
        title: "مراقبت و زیبایی مو",
        children: ["رنگ مو", "آرایش مو", "نرم کننده مو", "شامپو مو"],
      },
      {
        title: "لوازم بهداشتی",
        children: [
          "مسواک",
          "خمیر دندان",
          "کاندوم",
          "نوار بهداشتی",
          "لوازم اصلاح مو",
        ],
      },
      {
        title: "عطر و ادکلن",
        children: [
          "عطر و ادکلن زنانه",
          "عطر و ادکلن مردانه",
          "بادی اسپلش",
          "عطر جیبی",
        ],
      },
      {
        title: "لوازم آرایشی",
        children: [
          "آرایش صورت",
          "آرایش چشم",
          "آرایش ابرو",
          "آرایش لب",
          "ابزار آرایشی",
        ],
      },
      {
        title: "مراقبت پوست",
        children: [
          "ضد آفتاب",
          "کرم مرطوب کننده",
          "ماسک صورت",
          "پاک کننده صورت",
          "تونر",
        ],
      },
      {
        title: "مراقبت و زیبایی مو",
        children: ["رنگ مو", "آرایش مو", "نرم کننده مو", "شامپو مو"],
      },
      {
        title: "لوازم بهداشتی",
        children: [
          "مسواک",
          "خمیر دندان",
          "کاندوم",
          "نوار بهداشتی",
          "لوازم اصلاح مو",
        ],
      },
    ],
  },
  {
    title: "مد و پوشاک",
    icon: "apparel",
    subcategories: [
      {
        title: "لباس مردانه",
        children: [
          "تی شرت مردانه",
          "پولوشرت مردانه",
          "پیراهن مردانه",
          "شلوار مردانه",
          "لباس زیر مردانه",
        ],
      },
      {
        title: "لباس زنانه",
        children: [
          "تاپ زنانه",
          "تی شرت زنانه",
          "لباس راحتی زنانه",
          "لباس زیر زنانه",
          "هودی زنانه",
        ],
      },
      {
        title: "پوشاک دخترانه",
        children: [
          "پیراهن دخترانه",
          "ست لباس دخترانه",
          "هودی دخترانه",
          "شلوار دخترانه",
        ],
      },
      {
        title: "پوشاک نوزادی",
        children: [
          "ست لباس راحتی نوزاد",
          "بادی نوزاد",
          "ست نوزاد",
          "سرهمی نوزاد",
        ],
      },
      {
        title: "کفش مردانه",
        children: [
          "نیم بوت مردانه",
          "بوت مردانه",
          "کفش اسپرت مردانه",
          "صندل مردانه",
          "دمپایی مردانه",
        ],
      },
      {
        title: "لباس مردانه",
        children: [
          "تی شرت مردانه",
          "پولوشرت مردانه",
          "پیراهن مردانه",
          "شلوار مردانه",
          "لباس زیر مردانه",
        ],
      },
      {
        title: "لباس زنانه",
        children: [
          "تاپ زنانه",
          "تی شرت زنانه",
          "لباس راحتی زنانه",
          "لباس زیر زنانه",
          "هودی زنانه",
        ],
      },
      {
        title: "پوشاک دخترانه",
        children: [
          "پیراهن دخترانه",
          "ست لباس دخترانه",
          "هودی دخترانه",
          "شلوار دخترانه",
        ],
      },
      {
        title: "پوشاک نوزادی",
        children: [
          "ست لباس راحتی نوزاد",
          "بادی نوزاد",
          "ست نوزاد",
          "سرهمی نوزاد",
        ],
      },
      {
        title: "کفش زنانه",
        children: [
          "نیم بوت زنانه",
          "بوت زنانه",
          "کفش اسپرت زنانه",
          "صندل زنانه",
          "دمپایی زنانه",
        ],
      },
    ],
  },
  {
    title: "خودرو و موتور سیکلت",
    icon: "directions_car",
    subcategories: [
      {
        title: "لوازم مصرفی خودرو",
        children: ["روغن موتور", "فیلتر", "روغن گیربکس", "باتری", "لاستیک"],
      },
      { title: "خودرو", children: ["سدان", "شاسی", "پیکاپ"] },
      {
        title: "لوازم یدکی خودرو",
        children: [
          "لوازم بدنه",
          "چراغ",
          "آینه جانبی",
          "لوازم الکترونیکی",
          "لوازم مکانیکی",
        ],
      },
      {
        title: "لوازم صوتی و تصویری",
        children: [
          "دستگاه پخش",
          "بلندگو",
          "آمپلی فایر",
          "اف ام پلیر",
          "مسیریاب خودرو",
        ],
      },
      {
        title: "لوازم مصرفی خودرو",
        children: ["روغن موتور", "فیلتر", "روغن گیربکس", "باتری", "لاستیک"],
      },
      { title: "خودرو", children: ["سدان", "شاسی", "پیکاپ"] },
      {
        title: "لوازم یدکی خودرو",
        children: [
          "لوازم بدنه",
          "چراغ",
          "آینه جانبی",
          "لوازم الکترونیکی",
          "لوازم مکانیکی",
        ],
      },
      {
        title: "لوازم مصرفی خودرو",
        children: ["روغن موتور", "فیلتر", "روغن گیربکس", "باتری", "لاستیک"],
      },
      { title: "خودرو", children: ["سدان", "شاسی", "پیکاپ"] },
      {
        title: "لوازم یدکی خودرو",
        children: [
          "لوازم بدنه",
          "چراغ",
          "آینه جانبی",
          "لوازم الکترونیکی",
          "لوازم مکانیکی",
        ],
      },
      {
        title: "لوازم صوتی و تصویری",
        children: [
          "دستگاه پخش",
          "بلندگو",
          "آمپلی فایر",
          "اف ام پلیر",
          "مسیریاب خودرو",
        ],
      },
      {
        title: "لوازم صوتی و تصویری",
        children: [
          "دستگاه پخش",
          "بلندگو",
          "آمپلی فایر",
          "اف ام پلیر",
          "مسیریاب خودرو",
        ],
      },
      {
        title: "لوازم موتور سیکلت",
        children: ["لوازم مصرفی", "لوازم یدکی", "لوازم جانبی", "لوازم ضدسرقت"],
      },
      {
        title: "لوازم بر اساس نوع خودرو",
        children: ["206-207", "405", "MVM", "پراید", "تویوتا"],
      },
    ],
  },
  {
    title: "ابزارآلات و تجهیزات",
    icon: "build",
    subcategories: [
      {
        title: "ابزار برقی",
        children: [
          "دریل",
          "پیچ گوشتی و دریل شارژی",
          "آچار ضربه ای",
          "فرز و سنگ رومیزی",
          "موتور برق",
        ],
      },
      {
        title: "ابزار غیر برقی",
        children: ["نردبان", "متر", "چسب", "اره", "آچار"],
      },
      {
        title: "تجهیزات ایمنی و کار",
        children: ["کلاه", "دستکش", "ماسک", "لباس کار", "جعبه کمک های اولیه"],
      },
      {
        title: "لوازم باغبانی و کشاورزی",
        children: [
          "ابزار باغبانی",
          "ادوات کشاورزی",
          "بذر و تخم گیاهی",
          "کاشت و پرورش گیاهی",
        ],
      },
      {
        title: "ابزار برقی",
        children: [
          "دریل",
          "پیچ گوشتی و دریل شارژی",
          "آچار ضربه ای",
          "فرز و سنگ رومیزی",
          "موتور برق",
        ],
      },
      {
        title: "ابزار غیر برقی",
        children: ["نردبان", "متر", "چسب", "اره", "آچار"],
      },
      {
        title: "تجهیزات ایمنی و کار",
        children: ["کلاه", "دستکش", "ماسک", "لباس کار", "جعبه کمک های اولیه"],
      },
      {
        title: "شیرآلات",
        children: [
          "ست شیرآلات",
          "شیر ظرفشویی",
          "شیر روشویی",
          "شیر توالت",
          "شیر حمام",
        ],
      },
    ],
  },
  {
    title: "طلا و نقره",
    icon: "diamond",
    subcategories: [
      {
        title: "سکه طلا",
        children: ["ربع سکه", "نیم سکه", "تمام سکه", "سکه پارسیان", "سکه قسطی"],
      },
      {
        title: "طلای کم اجرت",
        children: [
          "گردنبند طلا کم اجرت",
          "دستبند طلا کم اجرت",
          "النگو طلا کم اجرت",
          "پابند طلا کم اجرت",
          "گوشواره طلا کم اجرت",
        ],
      },
      {
        title: "گردنبند طلا زنانه",
        children: [
          "گردنبند مرواریدی",
          "گردنبند چشم نظر",
          "گردنبند ونکلیف",
          "گردنبند کارتیر",
          "گردنبند مته تولد",
        ],
      },
      {
        title: "سکه طلا",
        children: ["ربع سکه", "نیم سکه", "تمام سکه", "سکه پارسیان", "سکه قسطی"],
      },
      {
        title: "طلای کم اجرت",
        children: [
          "گردنبند طلا کم اجرت",
          "دستبند طلا کم اجرت",
          "النگو طلا کم اجرت",
          "پابند طلا کم اجرت",
          "گوشواره طلا کم اجرت",
        ],
      },
      {
        title: "گردنبند طلا زنانه",
        children: [
          "گردنبند مرواریدی",
          "گردنبند چشم نظر",
          "گردنبند ونکلیف",
          "گردنبند کارتیر",
          "گردنبند مته تولد",
        ],
      },
      {
        title: "سکه طلا",
        children: ["ربع سکه", "نیم سکه", "تمام سکه", "سکه پارسیان", "سکه قسطی"],
      },
      {
        title: "طلای کم اجرت",
        children: [
          "گردنبند طلا کم اجرت",
          "دستبند طلا کم اجرت",
          "النگو طلا کم اجرت",
          "پابند طلا کم اجرت",
          "گوشواره طلا کم اجرت",
        ],
      },
      {
        title: "گردنبند طلا زنانه",
        children: [
          "گردنبند مرواریدی",
          "گردنبند چشم نظر",
          "گردنبند ونکلیف",
          "گردنبند کارتیر",
          "گردنبند مته تولد",
        ],
      },
      {
        title: "زیورآلات نقره مردانه",
        children: [
          "انگشتر نقره مردانه",
          "گردنبند نقره مردانه",
          "زنجیر نقره مردانه",
          "دستبند نقره مردانه",
        ],
      },
    ],
  },
  {
    title: "تجهیزات پزشکی",
    icon: "stethoscope",
    subcategories: [
      {
        title: "تجهیزات پزشکی",
        children: ["فشارسنج", "دماسنج محیطی", "ترازو", "تب سنج", "رطوبت گیر"],
      },
      {
        title: "مکمل غذایی",
        children: [
          "مکمل کمک درمانی",
          "مکمل کودک و نوزاد",
          "اعصاب و روان",
          "بینایی",
          "ترک اعتیاد",
        ],
      },
      {
        title: "کنترل دیابت",
        children: [
          "دستگاه تست قند خون",
          "نوار تست قند خون",
          "سوزن تست قند خون",
          "سرنگ انسولین",
        ],
      },
      {
        title: "تجهیزات پزشکی",
        children: ["فشارسنج", "دماسنج محیطی", "ترازو", "تب سنج", "رطوبت گیر"],
      },
      {
        title: "مکمل غذایی",
        children: [
          "مکمل کمک درمانی",
          "مکمل کودک و نوزاد",
          "اعصاب و روان",
          "بینایی",
          "ترک اعتیاد",
        ],
      },
      {
        title: "کنترل دیابت",
        children: [
          "دستگاه تست قند خون",
          "نوار تست قند خون",
          "سوزن تست قند خون",
          "سرنگ انسولین",
        ],
      },
      {
        title: "لوازم پزشکی مصرفی",
        children: [
          "تزریقات",
          "پانسمان",
          "چسب پانسمان",
          "کیت تشخیص",
          "دستکش های طبی",
        ],
      },
      {
        title: "مکمل ورزشی",
        children: ["آمینو اسید", "کراتین", "مکمل افزایش وزن", "مکمل کاهش وزن"],
      },
      {
        title: "ماساژور",
        children: ["ماساژور دستی", "صندلی ماساژور", "ماساژور برقی"],
      },
    ],
  },
  {
    title: "کتاب و هنر",
    icon: "brush",
    subcategories: [
      {
        title: "کتاب و مجله",
        children: ["کتاب چاپی", "مجلات خارجی و داخلی", "شهر کتاب مشهد"],
      },
      {
        title: "محبوب ترین آثار",
        children: [
          "کتاب های سعدی",
          "کتاب های حافظ",
          "کتاب های خیام",
          "کتاب های فردوسی",
          "کتاب های مولانا",
        ],
      },
      {
        title: "محتوای آموزشی",
        children: [
          "آموزش موسیقی",
          "آموزش ورزش و سرگرمی",
          "آموزش زبان",
          "آموزش کامپیوتر",
          "آموزش نرم افزار",
        ],
      },
      {
        title: "کتاب و مجله",
        children: ["کتاب چاپی", "مجلات خارجی و داخلی", "شهر کتاب مشهد"],
      },
      {
        title: "محبوب ترین آثار",
        children: [
          "کتاب های سعدی",
          "کتاب های حافظ",
          "کتاب های خیام",
          "کتاب های فردوسی",
          "کتاب های مولانا",
        ],
      },
      {
        title: "محتوای آموزشی",
        children: [
          "آموزش موسیقی",
          "آموزش ورزش و سرگرمی",
          "آموزش زبان",
          "آموزش کامپیوتر",
          "آموزش نرم افزار",
        ],
      },
      {
        title: "آلات موسیقی",
        children: [
          "گیتار",
          "ارگ",
          "پیانو",
          "سنتور",
          "هنگ درام",
          "ویولن",
          "سازهای ایرانی",
        ],
      },
      {
        title: "صنایع دستی",
        children: [
          "کالاهای مسی",
          "سفال٬سرامیک و چینی",
          "کیف چرمی",
          "تابلو و ساعت",
          "سوزن دوزی",
        ],
      },
    ],
  },
  {
    title: "ورزش و سفر",
    icon: "camping",
    subcategories: [
      {
        title: "کفش ورزشی",
        children: ["کفش فوتسال", "کفش فوتبال", "کفش کشتی", "کفش بسکتبال"],
      },
      {
        title: "تجهیزات سفر",
        children: ["ساک و چمدان", "کیف و کوله پشتی", "چادر مسسافرتی"],
      },
      {
        title: "کفش ورزشی",
        children: ["کفش فوتسال", "کفش فوتبال", "کفش کشتی", "کفش بسکتبال"],
      },
      {
        title: "تجهیزات سفر",
        children: ["ساک و چمدان", "کیف و کوله پشتی", "چادر مسسافرتی"],
      },
      {
        title: "کوهنوردی و کمپینگ",
        children: [
          "کفش کوهنوردی",
          "عصای کوهنوردی",
          "چراغ قوه",
          "قمقمه و فلاسک",
          "کیسه خواب",
        ],
      },
      { title: "ورزش های توپی", children: ["توپ", "راکت"] },
      {
        title: "ورزش های هوازی و بدن سازی",
        children: ["دمبل", "طناب", "تردمیل", "بارفیکس"],
      },
    ],
  },
  {
    title: "کارت هدیه و گیفت کارت",
    icon: "redeem",
    subcategories: [
      {
        title: "کارت هدیه بر اساس مناسبت",
        children: [
          "کارت هدیه تولد",
          "کارت هدیه روز مادر",
          "کارت هدیه روز معلم",
          "کارت هدیه سالگرد",
          "کارت هدیه تشکر",
          "کارت هدیه ازدواج",
          "کارت هدیه خانه نو",
          "کارت هدیه عید نوروز",
          "کارت هدیه شب یلدا",
        ],
      },
      {
        title: "کارت هدیه بر اساس قیمت",
        children: [
          "کارت هدیه ۵۰۰ هزار تومانی",
          "کارت هدیه از ۵۰۰ هزار تومان تا ۲ میلیون تومان",
          "کارت هدیه از ۲ میلیون تا ۵ میلیون تومان",
          "کارت هدیه از ۵ میلیون تا ۱۰ میلیون تومان",
          "کارت هدیه از ۱۰ میلیون تا ۱۵ میلیون تومان",
        ],
      },
    ],
  },
  {
    title: "سوپرمارکت آنلاین",
    icon: "store",
    subcategories: [
      {
        title: "کالاهای اساسی و خواربار",
        children: ["ماکارونی", "برنج", "نبات", "قند", "شکر"],
      },
      {
        title: "روغن",
        children: [
          "روغن مایع",
          "روغن جامد",
          "روغن کنجد",
          "روغن زیتون",
          "روغن ذرت",
        ],
      },
      {
        title: "چای و دمنوش",
        children: ["چای سیاه", "چای سبز", "دمنوش", "چای ماسالا"],
      },
      {
        title: "غذاهای آماده و نیمه آماده",
        children: ["تن ماهی", "نودل", "غذاهای کنسروی"],
      },
      { title: "قهوه", children: ["دانه قهوه", "اسپرسو", "قهوه فوری"] },
      {
        title: "تنقلات",
        children: [
          "چیپس",
          "پفک",
          "تخمه",
          "لواشک",
          "شکلات",
          "پاستیل",
          "آدامس",
          "کیک",
        ],
      },
      {
        title: "آجیل",
        children: ["پسته", "بادام درختی", "بادام هندی", "فندق", "انجیر"],
      },
      { title: "شیرینی", children: ["گز", "پوهان", "پولکی", "پشمک", "مسقطی"] },
    ],
  },
];
const categoryContainer = document.querySelector(".side-menu__categories");
const subcategoryContainer = document.querySelector(
  ".side-menu__subcategories"
);
const sideMenuLink = document.querySelector(
  ".site-nav__desktop--category-item"
);
const sideMenu = document.querySelector(
  ".site-nav__desktop--category--side-menu--inactive"
);
const backDrop = document.querySelector(".menu-backdrop");
const header = document.querySelector(".site-header");

menuData.forEach((item) => {
  const categoryItem = document.createElement("a");
  categoryItem.href = "#";
  categoryItem.className = "side-menu__categories-item";
  categoryItem.innerHTML = `<span class="material-symbols-outlined">${item.icon}</span> ${item.title}`;
  categoryContainer.appendChild(categoryItem);

  const subcategorySection = document.createElement("div");
  subcategorySection.className =
    "side-menu__subcategories-section subcategories-section--inactive";

  let subHTML = `<a href="#" class="side-menu__subcategories-section--header">همه محصولات ${item.title} <span class="material-symbols-outlined">chevron_left</span></a>`;
  subHTML += `<div class="side-menu__subcategories-section--body">`;

  item.subcategories.forEach((sub) => {
    subHTML += `<div class="side-menu__subcategories-section--body-item">
                  <a href="#" class="title__link">${sub.title}<span class="material-symbols-outlined">chevron_left</span></a>`;
    if (sub.children) {
      sub.children.forEach((child) => {
        subHTML += `<a href="#" class="subtitle__link">${child}</a>`;
      });
    }
    subHTML += `</div>`;
  });

  subHTML += `</div>`;
  subcategorySection.innerHTML = subHTML;
  subcategoryContainer.appendChild(subcategorySection);
});

const categoryItems = document.querySelectorAll(".side-menu__categories-item");
const subcategorySections = document.querySelectorAll(
  ".side-menu__subcategories-section"
);

sideMenuLink.addEventListener("mousemove", () => {
  sideMenu.classList.add("site-nav__desktop--category--side-menu");
  subcategoryContainer.firstElementChild.classList.remove(
    "subcategories-section--inactive"
  );
  backDrop.style.display = "block";
});

sideMenu.addEventListener("mouseleave", () => {
  sideMenu.classList.remove("site-nav__desktop--category--side-menu");
  backDrop.style.display = "none";
  subcategorySections.forEach((s) =>
    s.classList.add("subcategories-section--inactive")
  );
});

backDrop.addEventListener("mouseenter", () => {
  sideMenu.classList.remove("site-nav__desktop--category--side-menu");
  backDrop.style.display = "none";
});

categoryItems.forEach((categoryItem, i) => {
  const subcategory = subcategorySections[i];

  categoryItem.addEventListener("mouseenter", () => {
    subcategorySections.forEach((s) =>
      s.classList.add("subcategories-section--inactive")
    );
    subcategory.classList.remove("subcategories-section--inactive");
  });
});

header.addEventListener("mouseenter", () => {
  sideMenu.classList.remove("site-nav__desktop--category--side-menu");
  backDrop.style.display = "none";
});

